export const dailyAttribues = [
  {
    title: '날짜',
  },
  {
    title: '원금',
  },
  {
    title: '입출금',
  },
  {
    title: '일손익',
  },
  {
    title: '일수익률',
  },
  {
    title: '누적손익',
  },
  {
    title: '누적수익률',
  },
  {
    title: '수정',
  },
];

export const monthlyAttribues = [
  {
    title: '월',
  },
  {
    title: '월평균 원금',
  },
  {
    title: '입출금',
  },
  {
    title: '월 손익',
  },
  {
    title: '월 수익률',
  },
  {
    title: '누적손익',
  },
  {
    title: '누적수익률',
  },
  {
    title: '수정',
  },
];

export const statisticsLabels = [
  '잔고',
  '누적 입출금액',
  '원금',
  '누적 손익 금액',
  '누적 손익률',
  '현재 자본인하금액',
  '현재 자본인하율(%)',
  '평균 손익 금액',
  '평균 손익률',
  '최대 일수익 금액',
  '총 매매 일수',
  '총 이익 일수',
  '총 손실 일수',
  '승률',
  '고정갱신 후 경과일',
  '운용기간',
  '시작일자',
  '종료일자',
  '최대 누적손익금액',
  '최대 누적손익률',
  '최대 자본인하금액',
  '최대 자본인하율(%)',
  '최대 일수익율',
  '최대 일손실 금액',
  '최대 일손실율',
  '현재 연속 손익일수',
  '최대 연속 이익일수',
  '최대 연속 손실일수',
  'Profit Factor',
  'ROA',
];
